{
  "ipc 1": "Title and extent of operation of the Code (Indian Penal Code applies to whole of India).",
  "ipc 2": "Punishment of offences committed within India; general territorial application.",
  "ipc 3": "Punishment of offences committed beyond India but triable in India under certain conditions.",
  "ipc 4": "Extension of the Code to extra-territorial offences in certain cases.",
  "ipc 5": "Certain laws not affected by the Act (savings provisions).",
  "ipc 34": "Acts done by several persons in furtherance of common intention — joint liability.",
  "ipc 120a": "Definition of criminal conspiracy (historical note/definition).",
  "ipc 120b": "Punishment for criminal conspiracy — penalties based on the object of conspiracy.",
  "ipc 141": "Definition of unlawful assembly — criteria for assembly to be unlawful.",
  "ipc 143": "Punishment for being a member of an unlawful assembly.",
  "ipc 146": "Rioting — when force or violence is used by an unlawful assembly.",
  "ipc 147": "Punishment for rioting.",
  "ipc 148": "Rioting while armed with deadly weapon — higher penalty.",
  "ipc 149": "Every member of unlawful assembly guilty of offence committed in prosecution of common object.",
  "ipc 153a": "Promoting enmity between different groups on grounds of religion, race, etc.",
  "ipc 182": "Giving false information to a public servant — obstructing public function.",
  "ipc 191": "Giving false evidence — perjury (punishment for willfully giving false evidence).",
  "ipc 192": "Fabricating false evidence — creating false documents or evidence.",
  "ipc 201": "Causing disappearance of evidence of offence or giving false information to screen offender.",
  "ipc 203": "Giving false information respecting an offence — misleading investigators.",
  "ipc 209": "Dishonestly making false claim in court (wrongful claim or denial).",
  "ipc 268": "Public nuisance — acts endangering public health, safety or convenience.",
  "ipc 269": "Negligent act likely to spread infection of disease dangerous to life.",
  "ipc 270": "Malignant act likely to spread infection of disease dangerous to life.",
  "ipc 278": "Making atmosphere noxious to health — endangering public health via emissions.",
  "ipc 283": "Danger or obstruction in public way or line of navigation.",
  "ipc 292": "Sale, etc., of obscene books, pamphlets: obscenity offences.",
  "ipc 295": "Injuring or defiling a place of worship with intent to insult religion.",
  "ipc 295a": "Deliberate and malicious acts intended to outrage religious feelings of any class.",
  "ipc 298": "Uttering words, etc., with deliberate intent to wound religious feelings.",
  "ipc 300": "Definition of murder — acts and circumstances constituting murder.",
  "ipc 302": "Punishment for murder — death or imprisonment for life and fine.",
  "ipc 304": "Punishment for culpable homicide not amounting to murder — graded penalties.",
  "ipc 304a": "Causing death by negligence — punishments for negligent acts causing death.",
  "ipc 306": "Abetment of suicide — punishment for abetting another's suicide.",
  "ipc 307": "Attempt to murder — punishment up to 10 years or life imprisonment in severe cases.",
  "ipc 308": "Attempt to commit culpable homicide — attempts to cause serious bodily harm.",
  "ipc 309": "Attempt to commit suicide — attempts and legal treatment (varied in practice).",
  "ipc 312": "Causing miscarriage — punishment (different penalties when consent absent).",
  "ipc 316": "Causing death of a quick unborn child by an act amounting to culpable homicide.",
  "ipc 317": "Exposure and abandonment of child under twelve years by parent or person having care of it.",
  "ipc 319": "Definition of hurt — bodily pain, disease, infirmity caused to another.",
  "ipc 320": "Definition of grievous hurt — specific injuries qualifying as grievous.",
  "ipc 323": "Punishment for voluntarily causing hurt — imprisonment, fine or both.",
  "ipc 324": "Voluntarily causing hurt by dangerous weapons or means — higher penalty.",
  "ipc 325": "Punishment for voluntarily causing grievous hurt — higher imprisonment and fine.",
  "ipc 326": "Voluntarily causing grievous hurt by dangerous weapons or means — severe penalties.",
  "ipc 328": "Causing hurt by means of poison, etc., with intent to commit an offence.",
  "ipc 331": "Voluntarily causing grievous hurt to extort confession or for unlawful advantage.",
  "ipc 339": "Definition of wrongful restraint — preventing a person from moving as they wish.",
  "ipc 340": "Definition of wrongful confinement — confinement against the person's will.",
  "ipc 341": "Punishment for wrongful restraint — simple penalties.",
  "ipc 342": "Punishment for wrongful confinement — imprisonment or fine.",
  "ipc 349": "Definition of force — any use of force upon or toward the body of another.",
  "ipc 350": "Definition of criminal force — force used to commit an offence or with criminal intent.",
  "ipc 351": "Definition of assault — causing apprehension of criminal force.",
  "ipc 354": "Assault or criminal force to woman with intent to outrage her modesty — penal provision.",
  "ipc 354a": "Sexual harassment — definition and punishment for workplace and public harassment.",
  "ipc 354b": "Assault or use of criminal force to woman with intent to disrobe.",
  "ipc 354c": "Voyeurism — watching or capturing images of a woman engaged in private acts.",
  "ipc 354d": "Stalking — repeated following or contacting a woman causing alarm.",
  "ipc 363": "Punishment for kidnapping — wrongful removal or confinement of a person.",
  "ipc 364": "Kidnapping or abducting in order to murder — very severe penalty.",
  "ipc 366": "Kidnapping, abducting or inducing woman to compel her marriage.",
  "ipc 376": "Punishment for rape — stringent imprisonment and fines (various amendments exist).",
  "ipc 376a": "Causing death or resulting in persistent vegetative state of rape victim (aggravated).",
  "ipc 376d": "Gang rape — special provision for gang/collective rape offences.",
  "ipc 377": "Unnatural offences — historical provision dealing with unnatural acts (modern changes evolved).",
  "ipc 379": "Punishment for theft — definition and penalty.",
  "ipc 380": "Theft in dwelling house, etc. — higher penalty compared to simple theft.",
  "ipc 381": "Theft by clerk or servant of property in possession of master.",
  "ipc 383": "Definition of extortion — causing a person to deliver property by threat.",
  "ipc 384": "Punishment for extortion — penal sentences for extortion.",
  "ipc 390": "Definition of robbery — theft with violence or threat of violence.",
  "ipc 392": "Punishment for robbery — imprisonment and fines.",
  "ipc 395": "Punishment for dacoity — robbery by five or more persons (dacoity).",
  "ipc 397": "Robbery or dacoity, with attempt to cause death or grievous hurt.",
  "ipc 399": "Making preparation to commit dacoity — penal provisions for planning dacoity.",
  "ipc 403": "Dishonest misappropriation of property — unlawful appropriation.",
  "ipc 406": "Punishment for criminal breach of trust — penalties for betraying trust.",
  "ipc 409": "Criminal breach of trust by public servant, banker, merchant or agent.",
  "ipc 415": "Definition of cheating — deception to cause delivery of property or consent.",
  "ipc 420": "Cheating and dishonestly inducing delivery of property — penal punishment.",
  "ipc 425": "Definition of mischief — causing wrongful loss or damage to property.",
  "ipc 427": "Mischief causing damage to the amount of fifty rupees or more (historic threshold).",
  "ipc 441": "Definition of criminal trespass — entering property illegally.",
  "ipc 447": "Punishment for criminal trespass — penalties for unlawful entry.",
  "ipc 452": "House-trespass after preparation for hurt, assault, or wrongful restraint.",
  "ipc 463": "Definition of forgery — making a false document with intent to defraud.",
  "ipc 465": "Punishment for forgery — penalties for making forged documents.",
  "ipc 468": "Forgery for purpose of cheating — aggravated forging for cheating.",
  "ipc 471": "Using as genuine a forged document — punishing use of forged documents.",
  "ipc 499": "Definition of defamation — harming reputation by false statements.",
  "ipc 500": "Punishment for defamation — fine or imprisonment in some cases.",
  "ipc 503": "Definition of criminal intimidation — threats to cause injury or loss.",
  "ipc 506": "Punishment for criminal intimidation — imprisonment or fine.",
  "ipc 509": "Word, gesture or act intended to insult the modesty of a woman — prejudice offence.",
  "ipc 120aa": "Supplementary conspiracies and related procedural provisions (historical references).",
  "bns 1": "BNS: Short title, commencement and application — Bharatiya Nyaya Sanhita (2023) begins.",
  "bns 4": "BNS: Punishments — general scheme for punishments under BNS.",
  "bns chapter 3": "BNS General exceptions — defences and exceptions which may absolve criminal liability.",
  "bns 61": "BNS contains provisions corresponding to conspiracy and abetment (comparative numbering varies).",
  "bns organized crime": "BNS contains specific sections for organised crime and higher penalties for syndicates.",
  "bail": "Bail is the conditional release of an accused person with a promise to appear before the court when required.",
  "fir": "FIR stands for First Information Report — document prepared by police to begin investigation into a cognizable offence.",
  "contract": "A contract is a legally binding agreement enforceable by law between two or more parties.",
  "negligence": "Negligence is the failure to exercise reasonable care resulting in damage or injury to another person.",
  "warrant": "A warrant is a legal document issued by a judge allowing police to perform an action like arrest or search.",
  "affidavit": "An affidavit is a written statement confirmed by oath or affirmation, used as evidence in court.",
  "summons": "A summons is a legal notice issued by a court directing a person to appear before it.",
  "testimony": "Testimony is a formal written or spoken statement given in a court of law.",
  "plaintiff": "A plaintiff is a person who brings a case against another in a court of law.",
  "defendant": "A defendant is a person or entity accused or sued in a court of law.",
  "cross examination": "Cross-examination is the questioning of a witness by the opposing party in a court to test their credibility.",
  "evidence": "Evidence includes all materials, statements, and documents presented to prove or disprove facts in a case.",
  "subpoena": "A subpoena is a legal order requiring someone to attend court or produce documents.",
  "appeal": "An appeal is a request made to a higher court to review and change the decision of a lower court.",
  "judgment": "A judgment is the final decision given by a court in a legal case.",
  "civil case": "A civil case involves private disputes between individuals or organizations, often over rights or property.",
  "criminal case": "A criminal case involves prosecution by the government of a person accused of committing a crime.",
  "litigation": "Litigation is the process of taking legal action through the courts.",
  "advocate": "An advocate is a legal professional authorized to represent clients in court.",
  "arbitration": "Arbitration is a method of resolving disputes outside the courts by one or more appointed arbitrators.",
  "jurisdiction": "Jurisdiction is the authority given to a court to hear and decide cases within a particular area or type of law.",
  "notary": "A notary public is an authorized person who attests or certifies documents and administers oaths.",
  "bns 2" :"Definitions — provides key definitions used throughout the BNS.",
  "bns 3": "Short title, commencement and application — Bharatiya Nyaya Sanhita (2023) begins.",
  "bns 4": "Punishments — general scheme for punishments under BNS.",
  "bns 5": "Extra-territorial application of the BNS — offenses committed outside India but triable within India.",
  "bns 6": "Punishment for offences committed beyond India — applies to Indian citizens abroad.",
  "bns 101": "Offence of murder — punishment for causing death with intention or knowledge.",
  "bns 103": "Culpable homicide not amounting to murder — lesser punishment depending on intent.",
  "bns 113": "Abetment of suicide — punishment for encouraging or aiding suicide.",
  "bns 115": "Attempt to commit suicide — person may be referred for counseling instead of punishment.",
  "bns 317": "Rape — imprisonment not less than 10 years, may extend to life imprisonment.",
  "bns 324": "Dowry death — punishment for causing death of woman due to dowry harassment.",
  "bns 327": "Cruelty by husband or relatives — imprisonment up to 3 years and fine.",
  "bns 355": "Theft — imprisonment up to 3 years or fine or both.",
  "bns 357": "Robbery — imprisonment up to 10 years and fine.",
  "bns 359": "Dacoity — imprisonment for life or up to 10 years and fine.",
  "bns 360": "Criminal misappropriation of property — imprisonment up to 2 years or fine.",
  "bns 365": "Cheating — imprisonment up to 3 years or fine or both.",
  "bns 367": "Forgery — imprisonment up to 7 years and fine.",
  "bns 368": "Using forged documents — same punishment as forgery.",
  
  "it act 66a": "Sending offensive messages through communication service — punishable under IT Act.",
  "it act 43": "Penalty for damage to computer or data — compensation for unauthorized access or destruction.",
  "posh act 2013": "Protection of Women from Sexual Harassment at Workplace Act — prevention and redressal mechanism.",
  "rti act 2005": "Right to Information Act — empowers citizens to seek information from public authorities.",
  "motor vehicles act 185": "Driving by a minor — punishment with fine and cancellation of registration.",
  "nda act 1957": "National Defence Academy Act — governs training and service regulations for cadets.",
  "juvenile justice act 2015": "Law for care and protection of children and trial of juveniles in conflict with law.",
  "pocso act 2012": "Protection of Children from Sexual Offences — defines sexual assault crimes and punishments.",
  "ndps act 1985": "Narcotic Drugs and Psychotropic Substances Act — regulates possession and trafficking of drugs."

}
